### 사용 DB 생성
- mysql client 이용

- DROP DATABASE IF EXISTS student_mgmt;
- CREATE DATABASE student_mgmt DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

* DEFAULT CHARSET=utf8 COLLATE=utf8_bin
  - 문자 인코딩(문자셋)과 관련된 설정 
    - 한글 데이터의 정확한 처리를 위해, 데이터베이스/테이블 생성시에 추가
    - 문자셋(Character set)은 각 문자가 컴퓨터에 저장될 때 어떠한 '코드'로 저장될지에 대한 규칙의 집합을 의미
  - 콜레이션(Collation)은 특정 문자 셋에 의해 데이터베이스에 저장된 값들을 비교 검색하거나 정렬 등의 작업을 위해 문자들을 서로 '비교' 할때 사용하는 규칙들의 집합을 의미

* 테이블 생성

USE student_mgmt;
DROP TABLE IF EXISTS students;
CREATE TABLE students (
  id TINYINT NOT NULL AUTO_INCREMENT,
  name VARCHAR(10) NOT NULL,
  gender ENUM('man','woman') NOT NULL,
  birth DATE NOT NULL,
  english TINYINT NOT NULL,
  math TINYINT NOT NULL,
  korean TINYINT NOT NULL,
  PRIMARY KEY (id)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

- ENUM 타입: 특정 값만 저장할 수 있도록 저장 가능 값을 지정해주는 데이터 타입
- ENGINE=InnoDB : 스토리지 엔진이 여러 가지 있음 이 중에서 InnoDB로 스토리지 엔진을 정해주는 명령 이 명령을 안해줘도 최근 Mysql 버전은 디폴트로 엔진을 InnoDB를 쓴다고 함
- 테이블을 만들때도 DEFAULT CHARSET=utf8 인코딩

- 데이터 입력

In [ ]:
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('dave', 'man', '1983-07-16', 90, 80, 71);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('minsun', 'woman', '1982-10-16', 30, 88, 60);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('david', 'man', '1982-12-10', 78, 77, 30);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('jade', 'man', '1979-11-1', 45, 66, 20);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('jane', 'man', '1990-11-12', 65, 32, 90);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('wage', 'woman', '1982-1-13', 76, 30, 80);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('tina', 'woman', '1982-12-3', 87, 62, 71);

#### pandas 라이브러리와 pymysql

1. read_sql()

    - sql 연결 객체를 활용하여 쿼리 구문으로 반환된 결과를 데이터 프레임으로 바로 생성해 주는 함수

In [4]:
import pymysql
import pandas as pd

In [6]:
host_name = 'localhost'
host_port = 3306
username = 'root'
password = '0000'
database_name = 'student_mgmt'

In [7]:
# db  연결
db = pymysql.connect(
    host=host_name,     # MySQL Server Address
    port=host_port,          # MySQL Server Port
    user=username,      # MySQL username
    passwd=password,    # password for MySQL username
    db=database_name,   # Database name
    charset='utf8'
)

pandas.readsql(쿼리, 연결된 db connection 객체, )

In [8]:
sql = "show tables"

In [9]:
df = pd.read_sql(sql, db)

In [10]:
df

  Tables_in_student_mgmt
0               students

In [11]:
sql = "select * from students"
df = pd.read_sql(sql,db)

In [12]:
df

   id    name gender       birth  english  math  korean
0   1    dave    man  1983-07-16       90    80      71
1   2  minsun  woman  1982-10-16       30    88      60
2   3   david    man  1982-12-10       78    77      30
3   4    jade    man  1979-11-01       45    66      20
4   5    jane    man  1990-11-12       65    32      90
5   6    wage  woman  1982-01-13       76    30      80
6   7    tina  woman  1982-12-03       87    62      71

In [14]:
df.to_csv('students.csv', sep=',', index=False, encoding='utf-8')
df

   id    name gender       birth  english  math  korean
0   1    dave    man  1983-07-16       90    80      71
1   2  minsun  woman  1982-10-16       30    88      60
2   3   david    man  1982-12-10       78    77      30
3   4    jade    man  1979-11-01       45    66      20
4   5    jane    man  1990-11-12       65    32      90
5   6    wage  woman  1982-01-13       76    30      80
6   7    tina  woman  1982-12-03       87    62      71

In [15]:
db.close()

#### 외래키(FOREIGN KEY)를 만드는 이유
* 두 테이블 사이에 관계를 선언해서, 데이터의 무결성을 보장

In [20]:
import pymysql
import pandas as pd

In [26]:
host_name = 'localhost'
host_port = 3306
username = 'root'
password = '0000'
database_name = 'sqldb'

In [27]:
# db  연결
db = pymysql.connect(
    host=host_name,     # MySQL Server Address
    port=host_port,          # MySQL Server Port
    user=username,      # MySQL username
    passwd=password,    # password for MySQL username
    db=database_name,   # Database name
    charset='utf8'
)

In [28]:
sql = "select * from buyTbl"
df = pd.read_sql(sql,db)
df

    num userID prodName groupName  price  amount
0     1    KBS      운동화        의류     30       2
1     2    KBS      노트북        전자   1000       1
2     3    JYP      모니터        전자    200       1
3     4    BBK      모니터        전자    200       5
4     5    KBS      청바지        의류     50       3
5     6    BBK      메모리        전자     80      10
6     7    SSK        책        서적     15       5
7     8    EJW        책        서적     15       2
8     9    EJW      청바지        의류     50       1
9    10    BBK      운동화        의류     30       2
10   11    EJW        책        서적     15       1
11   12    BBK      운동화        의류     30       2

#### buyTbl에 데이터를 추가

- 외래키로 지정되어 있는 userID에 입력되는 새로운 값 STJ가 userTb1에 없는 값이어서 무결성 오류 발생

In [29]:
cursor = db.cursor()
sql_query = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES('STJ', '운동화', '의류', 30, 2);""
cursor.execute(sql_query)
db.commit()

SyntaxError: EOL while scanning string literal (<ipython-input-29-15375c5ec77d>, line 2)

#### 에러가 나면 정상임
* CONSTRAINT `buyTbl_ibfk_1` FOREIGN KEY (`userID`) REFERENCES `userTbl` (`userID`)
* userTbl 에 userID가 STJ인 데이터가 없기 때문에, 
  - FOREIGN KEY (userID) REFERENCES userTbl(userID)
  - buyTbl 테이블의 userID 커럼은 userTbl 테이블의 userID를 참조할 때, userTbl 테이블에 userID가 STJ인 데이터가 없으면, 입력이 안됨
  - 데이터 무결성 (두 테이블간 관계에 있어서, 데이터의 정확성을 보장하는 제약 조건을 넣는 것임)
  - 현업에서는 꼭 필요한 경우만 사용하는 경우가 많음 (비즈니스 로직이 다양하기 때문에, 제약을 걸어놓을 경우, 예외적인 비즈니스 로직 처리가 어렵기 때문)

In [31]:
cursor = db.cursor()
SQL_QUERY = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES('BBK', '운동화', '의류', 30, 2);"
cursor.execute(SQL_QUERY)
db.commit()

에러나면, 가능하면 db connection 닫아주시고 , 다시 connection 해주는 편이 좋다

In [32]:
db.close()

In [37]:
def conn(d_name) :
    import pymysql
    host_name = 'localhost'
    host_port = 3306
    username = 'root'
    password = '0000'
    database_name = d_name

    # db  연결
    db = pymysql.connect(
        host=host_name,     # MySQL Server Address
        port=host_port,          # MySQL Server Port
        user=username,      # MySQL username
        passwd=password,    # password for MySQL username
        db=database_name,   # Database name
        charset='utf8'
    )
    return db

In [38]:
db = conn('sqlDB')

#### 이번에는 userTbl 에 userID가 STJ 인 데이터를 넣어준 후에, 다시 buyTbl userID에 STJ 관련 데이터를 넣어줍니다.

In [40]:
cursor = db.cursor()
sql_query = "INSERT INTO userTbl VALUES('STJ', '서태지', 1975, '경기', '011', '00000000', 117, '2014-4-4');"
cursor.execute(sql_query)
db.commit()

In [41]:
SQL_QUERY = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES('STJ', '운동화', '의류', 30, 2);"
cursor.execute(SQL_QUERY)
db.commit()

#### 이번에는 userTbl에 userID가 STJ 관련 데이터를 삭제해봅니다.

In [42]:
sql_query = "delete from userTbl where userID='STJ'"
cursor.execute(sql_query)
db.commit()

IntegrityError: (1451, 'Cannot delete or update a parent row: a foreign key constraint fails (`sqldb`.`buytbl`, CONSTRAINT `buytbl_ibfk_1` FOREIGN KEY (`userID`) REFERENCES `usertbl` (`userID`))')

#### 위의 코드가 에러나면 정상입니다.
* buyTbl 에 해당 userID를 참조하는 데이터가 있기 때문입니다